hello_text = (
    "Добро пожаловать в чат с ChatGPT. Сейчас эта фича находится в бете, и скорее всего, в будущем "
    "станет платной, т.к API у ChatGPT не беслпатное((\n\n"
    "Тем не менее, надеюсь вам понравится, я очень старался добавить эту штуку в своего бота 🥺\n\n"
    "⚠️ Внимение!!! Если ты открыл эту вкладку впервые, тебе нужно подождать до тех пор, пока статус "
    'самой верхней кнопке не сменится с "Ожидания ответа" на "Ожидание сообщения"\n\n'
)

dummy_answer = "Сообщение принято в обработку"
